---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.ContinuousRailType
source: html/7f8d677e-7b30-9963-070b-330ad38701d6.htm
---
# ContinuousRailType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.